## Plan Result (ithc-ithc)




<pre><code>Plan: 77 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.ithc-idam-internal.azurerm_private_dns_zone.zone[0]
  * module.ithc-idam-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;bastion-prod-vnet&#34;]
  * module.ithc-idam-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-infra-vnet-idam-ithc-internal&#34;]
  * module.ithc-idam-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-infra-vnet-ithc-internal&#34;]
  * module.ithc-idam-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-infra-vnet-mgmt&#34;]
  * module.ithc-idam-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;mgmt-infra-prod&#34;]
  * module.ithc-idam-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;reform-mgmt-core-vnet&#34;]
  * module.ithc-internal.azurerm_private_dns_a_record.this[&#34;ccd-data-0&#34;]
  * module.ithc-internal.azurerm_private_dns_a_record.this[&#34;neuvector00&#34;]
  * module.ithc-internal.azurerm_private_dns_a_record.this[&#34;neuvector00-api&#34;]
  * module.ithc-internal.azurerm_private_dns_a_record.this[&#34;neuvector01&#34;]
  * module.ithc-internal.azurerm_private_dns_a_record.this[&#34;neuvector01-api&#34;]
  * module.ithc-internal.azurerm_private_dns_zone.zone[0]
  * module.ithc-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;bastion-prod-vnet&#34;]
  * module.ithc-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-infra-vnet-idam-ithc-internal&#34;]
  * module.ithc-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-infra-vnet-ithc-internal&#34;]
  * module.ithc-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-infra-vnet-mgmt&#34;]
  * module.ithc-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;mgmt-infra-prod&#34;]
  * module.ithc-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;reform-mgmt-core-vnet&#34;]
  * module.ithc-platform.azurerm_private_dns_a_record.this[&#34;alertmanager-00&#34;]
  * module.ithc-platform.azurerm_private_dns_a_record.this[&#34;alertmanager-01&#34;]
  * module.ithc-platform.azurerm_private_dns_a_record.this[&#34;camunda-bpm&#34;]
  * module.ithc-platform.azurerm_private_dns_a_record.this[&#34;camunda-optimize&#34;]
  * module.ithc-platform.azurerm_private_dns_a_record.this[&#34;ccd-admin-web&#34;]
  * module.ithc-platform.azurerm_private_dns_a_record.this[&#34;cft-api-mgmt&#34;]
  * module.ithc-platform.azurerm_private_dns_a_record.this[&#34;docmosis&#34;]
  * module.ithc-platform.azurerm_private_dns_a_record.this[&#34;prometheus-00&#34;]
  * module.ithc-platform.azurerm_private_dns_a_record.this[&#34;prometheus-01&#34;]
  * module.ithc-platform.azurerm_private_dns_a_record.this[&#34;sds-api-mgmt&#34;]
  * module.ithc-platform.azurerm_private_dns_a_record.this[&#34;traefik-sds-00&#34;]
  * module.ithc-platform.azurerm_private_dns_a_record.this[&#34;traefik-sds-01&#34;]
  * module.ithc-platform.azurerm_private_dns_cname_record.this[&#34;administer-orgs&#34;]
  * module.ithc-platform.azurerm_private_dns_cname_record.this[&#34;adoption-web&#34;]
  * module.ithc-platform.azurerm_private_dns_cname_record.this[&#34;bar&#34;]
  * module.ithc-platform.azurerm_private_dns_cname_record.this[&#34;c100-application&#34;]
  * module.ithc-platform.azurerm_private_dns_cname_record.this[&#34;decree-absolute-aks&#34;]
  * module.ithc-platform.azurerm_private_dns_cname_record.this[&#34;decree-nisi-aks&#34;]
  * module.ithc-platform.azurerm_private_dns_cname_record.this[&#34;fact&#34;]
  * module.ithc-platform.azurerm_private_dns_cname_record.this[&#34;fact-admin&#34;]
  * module.ithc-platform.azurerm_private_dns_cname_record.this[&#34;fees-register&#34;]
  * module.ithc-platform.azurerm_private_dns_cname_record.this[&#34;gateway-ccd&#34;]
  * module.ithc-platform.azurerm_private_dns_cname_record.this[&#34;idam-api&#34;]
  * module.ithc-platform.azurerm_private_dns_cname_record.this[&#34;idam-testing-support-api&#34;]
  * module.ithc-platform.azurerm_private_dns_cname_record.this[&#34;idam-user-dashboard&#34;]
  * module.ithc-platform.azurerm_private_dns_cname_record.this[&#34;idam-web-admin&#34;]
  * module.ithc-platform.azurerm_private_dns_cname_record.this[&#34;idam-web-public&#34;]
  * module.ithc-platform.azurerm_private_dns_cname_record.this[&#34;immigration-appeal&#34;]
  * module.ithc-platform.azurerm_private_dns_cname_record.this[&#34;lau&#34;]
  * module.ithc-platform.azurerm_private_dns_cname_record.this[&#34;manage-case&#34;]
  * module.ithc-platform.azurerm_private_dns_cname_record.this[&#34;manage-org&#34;]
  * module.ithc-platform.azurerm_private_dns_cname_record.this[&#34;moneyclaims&#34;]
  * module.ithc-platform.azurerm_private_dns_cname_record.this[&#34;nfdiv&#34;]
  * module.ithc-platform.azurerm_private_dns_cname_record.this[&#34;nfdiv-cms&#34;]
  * module.ithc-platform.azurerm_private_dns_cname_record.this[&#34;nfdiv-cos&#34;]
  * module.ithc-platform.azurerm_private_dns_cname_record.this[&#34;paybubble&#34;]
  * module.ithc-platform.azurerm_private_dns_cname_record.this[&#34;paymentoutcome-web&#34;]
  * module.ithc-platform.azurerm_private_dns_cname_record.this[&#34;petitioner-frontend-aks&#34;]
  * module.ithc-platform.azurerm_private_dns_cname_record.this[&#34;plum&#34;]
  * module.ithc-platform.azurerm_private_dns_cname_record.this[&#34;privatelaw&#34;]
  * module.ithc-platform.azurerm_private_dns_cname_record.this[&#34;probate&#34;]
  * module.ithc-platform.azurerm_private_dns_cname_record.this[&#34;register-org&#34;]
  * module.ithc-platform.azurerm_private_dns_cname_record.this[&#34;respond-divorce-aks&#34;]
  * module.ithc-platform.azurerm_private_dns_cname_record.this[&#34;return-case-doc-ccd&#34;]
  * module.ithc-platform.azurerm_private_dns_cname_record.this[&#34;rpts&#34;]
  * module.ithc-platform.azurerm_private_dns_cname_record.this[&#34;sds-neuvector00&#34;]
  * module.ithc-platform.azurerm_private_dns_cname_record.this[&#34;sds-neuvector00-api&#34;]
  * module.ithc-platform.azurerm_private_dns_cname_record.this[&#34;sds-neuvector01&#34;]
  * module.ithc-platform.azurerm_private_dns_cname_record.this[&#34;sds-neuvector01-api&#34;]
  * module.ithc-platform.azurerm_private_dns_cname_record.this[&#34;toffee&#34;]
  * module.ithc-platform.azurerm_private_dns_cname_record.this[&#34;www-ccd&#34;]
  * module.ithc-platform.azurerm_private_dns_zone.zone[0]
  * module.ithc-platform.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;bastion-prod-vnet&#34;]
  * module.ithc-platform.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-infra-vnet-idam-ithc-internal&#34;]
  * module.ithc-platform.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-infra-vnet-ithc-internal&#34;]
  * module.ithc-platform.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-infra-vnet-mgmt&#34;]
  * module.ithc-platform.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;mgmt-infra-prod&#34;]
  * module.ithc-platform.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;reform-mgmt-core-vnet&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.ithc-idam-internal.azurerm_private_dns_zone.zone[0] will be created
  + resource "azurerm_private_dns_zone" "zone" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "service.core-compute-idam-ithc.internal"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "core-infra-intsvc-rg"
      + tags                                                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "ithc"
        }

      + soa_record {
          + email         = (known after apply)
          + expire_time   = (known after apply)
          + fqdn          = (known after apply)
          + host_name     = (known after apply)
          + minimum_ttl   = (known after apply)
          + refresh_time  = (known after apply)
          + retry_time    = (known after apply)
          + serial_number = (known after apply)
          + tags          = (known after apply)
          + ttl           = (known after apply)
        }
    }

  # module.ithc-idam-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link["bastion-prod-vnet"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "bastion-prod-vnet"
      + private_dns_zone_name = "service.core-compute-idam-ithc.internal"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "ithc"
        }
      + virtual_network_id    = "/subscriptions/2b1afc19-5ca9-4796-a56f-574a58670244/resourceGroups/bastion-prod-rg/providers/Microsoft.Network/virtualNetworks/bastion-prod-vnet"
    }

  # module.ithc-idam-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link["core-infra-vnet-idam-ithc-internal"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "core-infra-vnet-idam-ithc-internal"
      + private_dns_zone_name = "service.core-compute-idam-ithc.internal"
      + registration_enabled  = true
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "ithc"
        }
      + virtual_network_id    = "/subscriptions/7a4e3bd5-ae3a-4d0c-b441-2188fee3ff1c/resourceGroups/core-infra-idam-ithc/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-idam-ithc"
    }

  # module.ithc-idam-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link["core-infra-vnet-ithc-internal"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "core-infra-vnet-ithc-internal"
      + private_dns_zone_name = "service.core-compute-idam-ithc.internal"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "ithc"
        }
      + virtual_network_id    = "/subscriptions/7a4e3bd5-ae3a-4d0c-b441-2188fee3ff1c/resourceGroups/core-infra-ithc/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-ithc"
    }

  # module.ithc-idam-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link["core-infra-vnet-mgmt"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "core-infra-vnet-mgmt"
      + private_dns_zone_name = "service.core-compute-idam-ithc.internal"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "ithc"
        }
      + virtual_network_id    = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/rg-mgmt/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-mgmt"
    }

  # module.ithc-idam-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link["mgmt-infra-prod"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "mgmt-infra-prod"
      + private_dns_zone_name = "service.core-compute-idam-ithc.internal"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "ithc"
        }
      + virtual_network_id    = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/mgmt-infra-prod/providers/Microsoft.Network/virtualNetworks/mgmt-infra-prod"
    }

  # module.ithc-idam-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link["reform-mgmt-core-vnet"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "reform-mgmt-core-vnet"
      + private_dns_zone_name = "service.core-compute-idam-ithc.internal"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "ithc"
        }
      + virtual_network_id    = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtCoreRG/providers/Microsoft.Network/virtualNetworks/reformMgmtCoreVNet"
    }

  # module.ithc-internal.azurerm_private_dns_a_record.this["ccd-data-0"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "ccd-data-0"
      + records             = [
          + "10.112.53.5",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "service.core-compute-ithc.internal"
    }

  # module.ithc-internal.azurerm_private_dns_a_record.this["neuvector00"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "neuvector00"
      + records             = [
          + "10.11.207.250",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "service.core-compute-ithc.internal"
    }

  # module.ithc-internal.azurerm_private_dns_a_record.this["neuvector00-api"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "neuvector00-api"
      + records             = [
          + "10.11.207.250",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "service.core-compute-ithc.internal"
    }

  # module.ithc-internal.azurerm_private_dns_a_record.this["neuvector01"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "neuvector01"
      + records             = [
          + "10.11.223.250",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "service.core-compute-ithc.internal"
    }

  # module.ithc-internal.azurerm_private_dns_a_record.this["neuvector01-api"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "neuvector01-api"
      + records             = [
          + "10.11.223.250",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "service.core-compute-ithc.internal"
    }

  # module.ithc-internal.azurerm_private_dns_zone.zone[0] will be created
  + resource "azurerm_private_dns_zone" "zone" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "service.core-compute-ithc.internal"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "core-infra-intsvc-rg"
      + tags                                                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "ithc"
        }

      + soa_record {
          + email         = (known after apply)
          + expire_time   = (known after apply)
          + fqdn          = (known after apply)
          + host_name     = (known after apply)
          + minimum_ttl   = (known after apply)
          + refresh_time  = (known after apply)
          + retry_time    = (known after apply)
          + serial_number = (known after apply)
          + tags          = (known after apply)
          + ttl           = (known after apply)
        }
    }

  # module.ithc-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link["bastion-prod-vnet"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "bastion-prod-vnet"
      + private_dns_zone_name = "service.core-compute-ithc.internal"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "ithc"
        }
      + virtual_network_id    = "/subscriptions/2b1afc19-5ca9-4796-a56f-574a58670244/resourceGroups/bastion-prod-rg/providers/Microsoft.Network/virtualNetworks/bastion-prod-vnet"
    }

  # module.ithc-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link["core-infra-vnet-idam-ithc-internal"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "core-infra-vnet-idam-ithc-internal"
      + private_dns_zone_name = "service.core-compute-ithc.internal"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "ithc"
        }
      + virtual_network_id    = "/subscriptions/7a4e3bd5-ae3a-4d0c-b441-2188fee3ff1c/resourceGroups/core-infra-idam-ithc/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-idam-ithc"
    }

  # module.ithc-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link["core-infra-vnet-ithc-internal"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "core-infra-vnet-ithc-internal"
      + private_dns_zone_name = "service.core-compute-ithc.internal"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "ithc"
        }
      + virtual_network_id    = "/subscriptions/7a4e3bd5-ae3a-4d0c-b441-2188fee3ff1c/resourceGroups/core-infra-ithc/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-ithc"
    }

  # module.ithc-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link["core-infra-vnet-mgmt"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "core-infra-vnet-mgmt"
      + private_dns_zone_name = "service.core-compute-ithc.internal"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "ithc"
        }
      + virtual_network_id    = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/rg-mgmt/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-mgmt"
    }

  # module.ithc-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link["mgmt-infra-prod"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "mgmt-infra-prod"
      + private_dns_zone_name = "service.core-compute-ithc.internal"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "ithc"
        }
      + virtual_network_id    = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/mgmt-infra-prod/providers/Microsoft.Network/virtualNetworks/mgmt-infra-prod"
    }

  # module.ithc-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link["reform-mgmt-core-vnet"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "reform-mgmt-core-vnet"
      + private_dns_zone_name = "service.core-compute-ithc.internal"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "ithc"
        }
      + virtual_network_id    = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtCoreRG/providers/Microsoft.Network/virtualNetworks/reformMgmtCoreVNet"
    }

  # module.ithc-platform.azurerm_private_dns_a_record.this["alertmanager-00"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "alertmanager-00"
      + records             = [
          + "10.11.207.250",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "ithc.platform.hmcts.net"
    }

  # module.ithc-platform.azurerm_private_dns_a_record.this["alertmanager-01"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "alertmanager-01"
      + records             = [
          + "10.11.223.250",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "ithc.platform.hmcts.net"
    }

  # module.ithc-platform.azurerm_private_dns_a_record.this["camunda-bpm"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "camunda-bpm"
      + records             = [
          + "10.11.225.111",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "ithc.platform.hmcts.net"
    }

  # module.ithc-platform.azurerm_private_dns_a_record.this["camunda-optimize"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "camunda-optimize"
      + records             = [
          + "10.11.225.111",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "ithc.platform.hmcts.net"
    }

  # module.ithc-platform.azurerm_private_dns_a_record.this["ccd-admin-web"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "ccd-admin-web"
      + records             = [
          + "10.11.225.111",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "ithc.platform.hmcts.net"
    }

  # module.ithc-platform.azurerm_private_dns_a_record.this["cft-api-mgmt"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "cft-api-mgmt"
      + records             = [
          + "10.11.225.133",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "ithc.platform.hmcts.net"
    }

  # module.ithc-platform.azurerm_private_dns_a_record.this["docmosis"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "docmosis"
      + records             = [
          + "10.11.225.111",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "ithc.platform.hmcts.net"
    }

  # module.ithc-platform.azurerm_private_dns_a_record.this["prometheus-00"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "prometheus-00"
      + records             = [
          + "10.11.207.250",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "ithc.platform.hmcts.net"
    }

  # module.ithc-platform.azurerm_private_dns_a_record.this["prometheus-01"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "prometheus-01"
      + records             = [
          + "10.11.223.250",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "ithc.platform.hmcts.net"
    }

  # module.ithc-platform.azurerm_private_dns_a_record.this["sds-api-mgmt"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "sds-api-mgmt"
      + records             = [
          + "10.143.33.133",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "ithc.platform.hmcts.net"
    }

  # module.ithc-platform.azurerm_private_dns_a_record.this["traefik-sds-00"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "traefik-sds-00"
      + records             = [
          + "10.143.15.250",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "ithc.platform.hmcts.net"
    }

  # module.ithc-platform.azurerm_private_dns_a_record.this["traefik-sds-01"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "traefik-sds-01"
      + records             = [
          + "10.143.31.250",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "ithc.platform.hmcts.net"
    }

  # module.ithc-platform.azurerm_private_dns_cname_record.this["administer-orgs"] will be created
  + resource "azurerm_private_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "administer-orgs"
      + record              = "hmcts-ithc.azurefd.net."
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "ithc.platform.hmcts.net"
    }

  # module.ithc-platform.azurerm_private_dns_cname_record.this["adoption-web"] will be created
  + resource "azurerm_private_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "adoption-web"
      + record              = "hmcts-ithc.azurefd.net."
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "ithc.platform.hmcts.net"
    }

  # module.ithc-platform.azurerm_private_dns_cname_record.this["bar"] will be created
  + resource "azurerm_private_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "bar"
      + record              = "hmcts-ithc.azurefd.net."
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "ithc.platform.hmcts.net"
    }

  # module.ithc-platform.azurerm_private_dns_cname_record.this["c100-application"] will be created
  + resource "azurerm_private_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "c100-application"
      + record              = "sdshmcts-ithc.azurefd.net"
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "ithc.platform.hmcts.net"
    }

  # module.ithc-platform.azurerm_private_dns_cname_record.this["decree-absolute-aks"] will be created
  + resource "azurerm_private_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "decree-absolute-aks"
      + record              = "hmcts-ithc.azurefd.net."
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "ithc.platform.hmcts.net"
    }

  # module.ithc-platform.azurerm_private_dns_cname_record.this["decree-nisi-aks"] will be created
  + resource "azurerm_private_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "decree-nisi-aks"
      + record              = "hmcts-ithc.azurefd.net."
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "ithc.platform.hmcts.net"
    }

  # module.ithc-platform.azurerm_private_dns_cname_record.this["fact"] will be created
  + resource "azurerm_private_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "fact"
      + record              = "hmcts-ithc.azurefd.net."
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "ithc.platform.hmcts.net"
    }

  # module.ithc-platform.azurerm_private_dns_cname_record.this["fact-admin"] will be created
  + resource "azurerm_private_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "fact-admin"
      + record              = "hmcts-ithc.azurefd.net."
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "ithc.platform.hmcts.net"
    }

  # module.ithc-platform.azurerm_private_dns_cname_record.this["fees-register"] will be created
  + resource "azurerm_private_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "fees-register"
      + record              = "hmcts-ithc.azurefd.net."
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "ithc.platform.hmcts.net"
    }

  # module.ithc-platform.azurerm_private_dns_cname_record.this["gateway-ccd"] will be created
  + resource "azurerm_private_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "gateway-ccd"
      + record              = "hmcts-ithc.azurefd.net."
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "ithc.platform.hmcts.net"
    }

  # module.ithc-platform.azurerm_private_dns_cname_record.this["idam-api"] will be created
  + resource "azurerm_private_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "idam-api"
      + record              = "idam-api-ithc.service.core-compute-ithc.internal."
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "ithc.platform.hmcts.net"
    }

  # module.ithc-platform.azurerm_private_dns_cname_record.this["idam-testing-support-api"] will be created
  + resource "azurerm_private_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "idam-testing-support-api"
      + record              = "idam-testing-support-api-ithc.service.core-compute-ithc.internal."
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "ithc.platform.hmcts.net"
    }

  # module.ithc-platform.azurerm_private_dns_cname_record.this["idam-user-dashboard"] will be created
  + resource "azurerm_private_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "idam-user-dashboard"
      + record              = "hmcts-ithc.azurefd.net."
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "ithc.platform.hmcts.net"
    }

  # module.ithc-platform.azurerm_private_dns_cname_record.this["idam-web-admin"] will be created
  + resource "azurerm_private_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "idam-web-admin"
      + record              = "hmcts-ithc.azurefd.net."
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "ithc.platform.hmcts.net"
    }

  # module.ithc-platform.azurerm_private_dns_cname_record.this["idam-web-public"] will be created
  + resource "azurerm_private_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "idam-web-public"
      + record              = "hmcts-ithc.azurefd.net."
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "ithc.platform.hmcts.net"
    }

  # module.ithc-platform.azurerm_private_dns_cname_record.this["immigration-appeal"] will be created
  + resource "azurerm_private_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "immigration-appeal"
      + record              = "hmcts-ithc.azurefd.net."
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "ithc.platform.hmcts.net"
    }

  # module.ithc-platform.azurerm_private_dns_cname_record.this["lau"] will be created
  + resource "azurerm_private_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "lau"
      + record              = "hmcts-ithc.azurefd.net."
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "ithc.platform.hmcts.net"
    }

  # module.ithc-platform.azurerm_private_dns_cname_record.this["manage-case"] will be created
  + resource "azurerm_private_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "manage-case"
      + record              = "hmcts-ithc.azurefd.net."
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "ithc.platform.hmcts.net"
    }

  # module.ithc-platform.azurerm_private_dns_cname_record.this["manage-org"] will be created
  + resource "azurerm_private_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "manage-org"
      + record              = "hmcts-ithc.azurefd.net."
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "ithc.platform.hmcts.net"
    }

  # module.ithc-platform.azurerm_private_dns_cname_record.this["moneyclaims"] will be created
  + resource "azurerm_private_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "moneyclaims"
      + record              = "hmcts-ithc.azurefd.net."
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "ithc.platform.hmcts.net"
    }

  # module.ithc-platform.azurerm_private_dns_cname_record.this["nfdiv"] will be created
  + resource "azurerm_private_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "nfdiv"
      + record              = "hmcts-ithc.azurefd.net."
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "ithc.platform.hmcts.net"
    }

  # module.ithc-platform.azurerm_private_dns_cname_record.this["nfdiv-cms"] will be created
  + resource "azurerm_private_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "nfdiv-cms"
      + record              = "hmcts-ithc.azurefd.net."
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "ithc.platform.hmcts.net"
    }

  # module.ithc-platform.azurerm_private_dns_cname_record.this["nfdiv-cos"] will be created
  + resource "azurerm_private_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "nfdiv-cos"
      + record              = "hmcts-ithc.azurefd.net."
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "ithc.platform.hmcts.net"
    }

  # module.ithc-platform.azurerm_private_dns_cname_record.this["paybubble"] will be created
  + resource "azurerm_private_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "paybubble"
      + record              = "hmcts-ithc.azurefd.net."
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "ithc.platform.hmcts.net"
    }

  # module.ithc-platform.azurerm_private_dns_cname_record.this["paymentoutcome-web"] will be created
  + resource "azurerm_private_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "paymentoutcome-web"
      + record              = "hmcts-ithc.azurefd.net"
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "ithc.platform.hmcts.net"
    }

  # module.ithc-platform.azurerm_private_dns_cname_record.this["petitioner-frontend-aks"] will be created
  + resource "azurerm_private_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "petitioner-frontend-aks"
      + record              = "hmcts-ithc.azurefd.net."
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "ithc.platform.hmcts.net"
    }

  # module.ithc-platform.azurerm_private_dns_cname_record.this["plum"] will be created
  + resource "azurerm_private_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "plum"
      + record              = "hmcts-ithc.azurefd.net."
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "ithc.platform.hmcts.net"
    }

  # module.ithc-platform.azurerm_private_dns_cname_record.this["privatelaw"] will be created
  + resource "azurerm_private_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "privatelaw"
      + record              = "hmcts-ithc.azurefd.net."
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "ithc.platform.hmcts.net"
    }

  # module.ithc-platform.azurerm_private_dns_cname_record.this["probate"] will be created
  + resource "azurerm_private_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "probate"
      + record              = "hmcts-ithc.azurefd.net."
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "ithc.platform.hmcts.net"
    }

  # module.ithc-platform.azurerm_private_dns_cname_record.this["register-org"] will be created
  + resource "azurerm_private_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "register-org"
      + record              = "hmcts-ithc.azurefd.net."
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "ithc.platform.hmcts.net"
    }

  # module.ithc-platform.azurerm_private_dns_cname_record.this["respond-divorce-aks"] will be created
  + resource "azurerm_private_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "respond-divorce-aks"
      + record              = "hmcts-ithc.azurefd.net."
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "ithc.platform.hmcts.net"
    }

  # module.ithc-platform.azurerm_private_dns_cname_record.this["return-case-doc-ccd"] will be created
  + resource "azurerm_private_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "return-case-doc-ccd"
      + record              = "hmcts-ithc.azurefd.net."
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "ithc.platform.hmcts.net"
    }

  # module.ithc-platform.azurerm_private_dns_cname_record.this["rpts"] will be created
  + resource "azurerm_private_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "rpts"
      + record              = "hmcts-ithc.azurefd.net."
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "ithc.platform.hmcts.net"
    }

  # module.ithc-platform.azurerm_private_dns_cname_record.this["sds-neuvector00"] will be created
  + resource "azurerm_private_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "sds-neuvector00"
      + record              = "traefik-sds-00.ithc.platform.hmcts.net"
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "ithc.platform.hmcts.net"
    }

  # module.ithc-platform.azurerm_private_dns_cname_record.this["sds-neuvector00-api"] will be created
  + resource "azurerm_private_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "sds-neuvector00-api"
      + record              = "traefik-sds-00.ithc.platform.hmcts.net"
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "ithc.platform.hmcts.net"
    }

  # module.ithc-platform.azurerm_private_dns_cname_record.this["sds-neuvector01"] will be created
  + resource "azurerm_private_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "sds-neuvector01"
      + record              = "traefik-sds-01.ithc.platform.hmcts.net"
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "ithc.platform.hmcts.net"
    }

  # module.ithc-platform.azurerm_private_dns_cname_record.this["sds-neuvector01-api"] will be created
  + resource "azurerm_private_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "sds-neuvector01-api"
      + record              = "traefik-sds-01.ithc.platform.hmcts.net"
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "ithc.platform.hmcts.net"
    }

  # module.ithc-platform.azurerm_private_dns_cname_record.this["toffee"] will be created
  + resource "azurerm_private_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "toffee"
      + record              = "sdshmcts-ithc.azurefd.net."
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "ithc.platform.hmcts.net"
    }

  # module.ithc-platform.azurerm_private_dns_cname_record.this["www-ccd"] will be created
  + resource "azurerm_private_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "www-ccd"
      + record              = "hmcts-ithc.azurefd.net."
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "ithc.platform.hmcts.net"
    }

  # module.ithc-platform.azurerm_private_dns_zone.zone[0] will be created
  + resource "azurerm_private_dns_zone" "zone" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "ithc.platform.hmcts.net"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "core-infra-intsvc-rg"
      + tags                                                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "ithc"
        }

      + soa_record {
          + email         = (known after apply)
          + expire_time   = (known after apply)
          + fqdn          = (known after apply)
          + host_name     = (known after apply)
          + minimum_ttl   = (known after apply)
          + refresh_time  = (known after apply)
          + retry_time    = (known after apply)
          + serial_number = (known after apply)
          + tags          = (known after apply)
          + ttl           = (known after apply)
        }
    }

  # module.ithc-platform.azurerm_private_dns_zone_virtual_network_link.vnet_link["bastion-prod-vnet"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "bastion-prod-vnet"
      + private_dns_zone_name = "ithc.platform.hmcts.net"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "ithc"
        }
      + virtual_network_id    = "/subscriptions/2b1afc19-5ca9-4796-a56f-574a58670244/resourceGroups/bastion-prod-rg/providers/Microsoft.Network/virtualNetworks/bastion-prod-vnet"
    }

  # module.ithc-platform.azurerm_private_dns_zone_virtual_network_link.vnet_link["core-infra-vnet-idam-ithc-internal"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "core-infra-vnet-idam-ithc-internal"
      + private_dns_zone_name = "ithc.platform.hmcts.net"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "ithc"
        }
      + virtual_network_id    = "/subscriptions/7a4e3bd5-ae3a-4d0c-b441-2188fee3ff1c/resourceGroups/core-infra-idam-ithc/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-idam-ithc"
    }

  # module.ithc-platform.azurerm_private_dns_zone_virtual_network_link.vnet_link["core-infra-vnet-ithc-internal"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "core-infra-vnet-ithc-internal"
      + private_dns_zone_name = "ithc.platform.hmcts.net"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "ithc"
        }
      + virtual_network_id    = "/subscriptions/7a4e3bd5-ae3a-4d0c-b441-2188fee3ff1c/resourceGroups/core-infra-ithc/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-ithc"
    }

  # module.ithc-platform.azurerm_private_dns_zone_virtual_network_link.vnet_link["core-infra-vnet-mgmt"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "core-infra-vnet-mgmt"
      + private_dns_zone_name = "ithc.platform.hmcts.net"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "ithc"
        }
      + virtual_network_id    = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/rg-mgmt/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-mgmt"
    }

  # module.ithc-platform.azurerm_private_dns_zone_virtual_network_link.vnet_link["mgmt-infra-prod"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "mgmt-infra-prod"
      + private_dns_zone_name = "ithc.platform.hmcts.net"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "ithc"
        }
      + virtual_network_id    = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/mgmt-infra-prod/providers/Microsoft.Network/virtualNetworks/mgmt-infra-prod"
    }

  # module.ithc-platform.azurerm_private_dns_zone_virtual_network_link.vnet_link["reform-mgmt-core-vnet"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "reform-mgmt-core-vnet"
      + private_dns_zone_name = "ithc.platform.hmcts.net"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "ithc"
        }
      + virtual_network_id    = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtCoreRG/providers/Microsoft.Network/virtualNetworks/reformMgmtCoreVNet"
    }

Plan: 77 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":420,"Program":"tfcmt","SHA1":"","Target":"ithc-ithc","Vars":{}} -->